УТ_для_edt/src/Documents/смартКорректировкаКоэффициентовМенеджеров/смартКорректировкаКоэффициентовМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартКорректировкаКоэффициентовМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 04.12.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКоэффициента</name>
    <type>
      <types>EnumRef.смартВидыКоэффициентовМенеджеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Менеджеры</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтВыручки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтКонверсии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтПотериЛидов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтКоммерческогоОтдела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтМаркетинговогоОтдела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартКоэффициентыМенеджеров/смартКоэффициентыМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартКоэффициентыМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 15.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзменениеКоэффициента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыдачаЗаблокирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыдачаЗаблокированаВручную</name>
    <comment>//++ #Б-3704 смарт: Фролов 07.07.2025 //Корректировка данных по отпускам и блокирование выдачи Интересов на основании данных регистра &quot;График отсутствия сотрудников&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКоэффициента</name>
    <type>
      <types>EnumRef.смартВидыКоэффициентовМенеджеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартВидыКоэффициентовМенеджеров/смартВидыКоэффициентовМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыКоэффициентовМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 07.12.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <enumValues>
    <name>ИтоговыйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтВыручки</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКонверсии</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтПотериЛидов</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКоммерческогоОтдела</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтМаркетинговогоОтдела</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартМенеджерСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочийТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТС</name>
    <comment>#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнутреннихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнешнихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТСДополнительный</name>
    <comment>//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОповещениеОбИнтересах</name>
    <comment>//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами. </comment>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Новые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершенные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запчасти</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныеМатериалы</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартКонтролируемыеМенеджеры</name>
    <comment>//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартКорректировкаКоэффициентовМенеджеров/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьДаннымиКоэффициентовМенеджеров();
	ИначеЕсли Объект.Проведен Тогда
		Элементы.ФормаЗаполнитьИсходнымиДанными.Доступность=Ложь;
	КонецЕсли;
	
	Если РольДоступна("смартРедактированиеКоэффициентовОтКоммерческогоОтдела") ТОгда
		Элементы.МенеджерыКоэффициентОтКоммерческогоОтдела.ТолькоПросмотр=Ложь;
		Элементы.МенеджерыКоэффициентОтМаркетинговогоОтдела.ЦветФона=Новый Цвет(248,242,216);
	ИначеЕсли РольДоступна("смартРедактированиеКоэффициентовОтМаркетинговогоОтдела") ТОгда
		Элементы.МенеджерыКоэффициентОтМаркетинговогоОтдела.ТолькоПросмотр=Ложь;
		Элементы.МенеджерыКоэффициентОтКоммерческогоОтдела.ЦветФона=Новый Цвет(248,242,216);
	ИначеЕсли Пользователи.ЭтоПолноправныйПользователь() ТОгда
		Элементы.МенеджерыКоэффициентОтКоммерческогоОтдела.ТолькоПросмотр=Ложь;
		Элементы.МенеджерыКоэффициентОтМаркетинговогоОтдела.ТолькоПросмотр=Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи); 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
	Элементы.ФормаЗаполнитьИсходнымиДанными.Доступность=Ложь;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтаФорма, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти 

Процедура ЗаполнитьДаннымиКоэффициентовМенеджеров()
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	смартКоэффициентыМенеджеровСрезПоследних.Менеджер КАК Менеджер,
	                    |	СУММА(ВЫБОР
	                    |			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	                    |				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	                    |			ИНАЧЕ 0
	                    |		КОНЕЦ) КАК ИтоговыйКоэффициент,
	                    |	СУММА(ВЫБОР
	                    |			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтВыручки)
	                    |				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	                    |			ИНАЧЕ 0
	                    |		КОНЕЦ) КАК КоэффициентОтВыручки,
	                    |	СУММА(ВЫБОР
	                    |			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКонверсии)
	                    |				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	                    |			ИНАЧЕ 0
	                    |		КОНЕЦ) КАК КоэффициентОтКонверсии,
	                    |	СУММА(ВЫБОР
	                    |			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтПотериЛидов)
	                    |				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	                    |			ИНАЧЕ 0
	                    |		КОНЕЦ) КАК КоэффициентОтПотериЛидов,
	                    |	СУММА(ВЫБОР
	                    |			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела)
	                    |				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	                    |			ИНАЧЕ 0
	                    |		КОНЕЦ) КАК КоэффициентОтКоммерческогоОтдела,
	                    |	СУММА(ВЫБОР
	                    |			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела)
	                    |				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	                    |			ИНАЧЕ 0
	                    |		КОНЕЦ) КАК КоэффициентОтМаркетинговогоОтдела
	                    |ИЗ
	                    |	РегистрСведений.смартКоэффициентыМенеджеров.СрезПоследних(
	                    |			,
	                    |			Менеджер В
	                    |				(ВЫБРАТЬ
	                    |					Пользователи.Ссылка КАК Ссылка
	                    |				ИЗ
	                    |					Справочник.Пользователи КАК Пользователи
	                    |				ГДЕ
	                    |					НЕ Пользователи.Недействителен)) КАК смартКоэффициентыМенеджеровСрезПоследних
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	смартКоэффициентыМенеджеровСрезПоследних.Менеджер");
	Объект.Менеджеры.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры	

&НаКлиенте
Процедура МенеджерыКоэффициентОтКоммерческогоОтделаПриИзменении(Элемент)
	Объект.ВидКоэффициента=ПредопределенноеЗначение("Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела");
КонецПроцедуры

&НаКлиенте
Процедура МенеджерыКоэффициентОтМаркетинговогоОтделаПриИзменении(Элемент)
	Объект.ВидКоэффициента=ПредопределенноеЗначение("Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсходнымиДанными(Команда)
	ЗаполнитьДаннымиКоэффициентовМенеджеров();
КонецПроцедуры
